src/cf/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ФИОФизическихЛиц/Forms/ФормаИзмененияФИО/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФИО = "";
	Если Не Параметры.Свойство("ФИО", ФИО) Тогда
		ТекстСообщения = НСтр("ru='Открытие формы возможно только из формы физического лица'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		Фамилия = ФИО.Фамилия;
		Имя = ФИО.Имя;
		Отчество = ФИО.Отчество;
		
	Иначе
		
		ЧастиФИО = СтрРазделить(ФИО, " ");
		Если ЧастиФИО.Количество() > 0 Тогда
			
			Фамилия = ЧастиФИО[0];
			
			Если ЧастиФИО.Количество() > 1 Тогда
				Имя = ЧастиФИО[1];
			КонецЕсли;
			
			Если ЧастиФИО.Количество() > 2 Тогда
				ЧастиОтчества = Новый Массив;
				Для индекс = 2 По ЧастиФИО.Количество() - 1 Цикл
					ЧастиОтчества.Добавить(ЧастиФИО[индекс]);
				КонецЦикла;
				Отчество = СтрСоединить(ЧастиОтчества, " ");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Период = ТекущаяДатаСеанса();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СтруктураФИО = Новый Структура;
	СтруктураФИО.Вставить("Фамилия", Фамилия);
	СтруктураФИО.Вставить("Имя", Имя);
	СтруктураФИО.Вставить("Отчество", Отчество);
	СтруктураФИО.Вставить("Период", Период);
	Закрыть(СтруктураФИО);
	
КонецПроцедуры

#КонецОбласти
